# Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

# Persiapan Data Frame

In [5]:
n_rows = 5
n_cols = 2
cols = ['omset', 'operasional']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                   columns=cols)
df

   omset  operasional
0     11            5
1      8            1
2      3            5
3     14            2
4      5           15

In [6]:
df['omset'] = df['omset'] * 100_000
df['operasional'] = df['operasional'] * 10_000
df

     omset  operasional
0  1100000        50000
1   800000        10000
2   300000        50000
3  1400000        20000
4   500000       150000

In [7]:
df.index = pd.util.testing.makeDateIndex(n_rows, freq='D')
df = df.reset_index()
df = df.rename(columns={'index':'tanggal'})
df

D:\Marnat\KULIAH\Semester 2\Statistika Bisnis\Annaconda\lib\site-packages\pandas\util\__init__.py:15: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

     tanggal    omset  operasional
0 2000-01-01  1100000        50000
1 2000-01-02   800000        10000
2 2000-01-03   300000        50000
3 2000-01-04  1400000        20000
4 2000-01-05   500000       150000

# Melakukan formatting tampilan Data Frame

In [11]:
formatku = {'tanggal':'{:%d/%m/%y}',
           'operasional':'Rp {:.2f})',
           'omset':'Rp {:.2f}'}

laporan = df.style.format(formatku)
laporan

In [12]:
type(laporan)

pandas.io.formats.style.Styler

In [13]:
laporan.hide_index()

In [16]:
laporan.set_caption('Data omset dan Operasional')

In [17]:
laporan.highlight_min('omset', color='pink')
laporan.highlight_max('omset', color='lightgreen')

In [18]:
laporan.highlight_min('operasional', color='lightblue')
laporan.highlight_max('operasional', color='grey')